import { z } from 'zod'

export const FormDataSchema = z.object({
  location: z.string().min(1, 'Мястото е задължително'),
  barber: z.string().min(1, 'Барбера е задължителен'),
  service: z.string().min(1, 'Услугата е задължителна'),
  data: z.string().min(1, 'Дата е задължителна'),
  hour: z.string().min(1, 'Часът е задължителен'),
  name: z.string().min(1, 'Името е задължително').max(50, 'Името не може да съдържа повече от 50 символа'),
  phone: z.string().min(10, 'Телефонният номер трябва да съдържа поне 10 цифри').max(15, 'Телефонният номер не може да съдържа повече от 15 цифри').regex(/^\+?[0-9]*$/, 'Телефонният номер трябва да съдържа само цифри и може да започва с +'),
  email: z.string().min(5, 'Имейлът трябва да съдържа поне 5 символа').max(100, 'Имейлът не може да съдържа повече от 100 символа').email('Невалиден имейл адрес'),
  note: z.string().optional(),
  confirm: z.boolean().refine(val => val === true, {
    message: 'Трябва да потвърдите информацията си'
  })
})